### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [4]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data_pd = pd.read_csv(file_to_load)
purchase_data_pd.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [5]:
# Display the total number of players
Total_Players = purchase_data_pd.loc[:,["SN", "Gender", "Age"]]
Total_Players = Total_Players.drop_duplicates()
Number_of_Players = Total_Players.count()[0]
pd.DataFrame({"Total Players":[Number_of_Players]})

   Total Players
0            576

In [6]:
# Display number of purchases
Total_Purchases = len(purchase_data_pd)
Total_Purchases

780

In [7]:
unique_Items = purchase_data_pd["Item Name"].unique()
len(unique_Items)

179

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [8]:
#Run basic calculations to obtain number of unique items, average price, etc.
Average_Price = round(purchase_data_pd["Price"].mean(), 2)
Average_Price

3.05

In [9]:
#Total Revenue 
Total_Revenue = purchase_data_pd["Price"].sum()
Total_Revenue

2379.77

In [10]:
summary_table = pd.DataFrame({"Total Purchases": [Total_Purchases],
                              "Average Price": [Average_Price],
                             "Total Revenue": [Total_Revenue],
                             "Unique Items":[len(unique_Items)]})
summary_table

   Total Purchases  Average Price  Total Revenue  Unique Items
0              780           3.05        2379.77           179

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [11]:
Gender_Count = Total_Players["Gender"].value_counts()
Gender_Count

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [12]:
Gender_Percent = Gender_Count/Number_of_Players * 100
Gender_Percent = Gender_Percent.round(2)
Gender_Percent

Male                     84.03
Female                   14.06
Other / Non-Disclosed     1.91
Name: Gender, dtype: float64

In [13]:
Gender_Table = pd.DataFrame({"Total Count": Gender_Count,"Percentage of Players": Gender_Percent})
Gender_Table

                       Total Count  Percentage of Players
Male                           484                  84.03
Female                          81                  14.06
Other / Non-Disclosed           11                   1.91


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [14]:
purchase_count = purchase_data_pd.groupby(['Gender']).count()["Price"].rename("Purchase Count")
avg_purchase_price = purchase_data_pd.groupby(['Gender']).mean()["Price"].rename("Average Purchase Price")
total_purchase_value = purchase_data_pd.groupby(['Gender']).sum()["Price"].rename("Total Purchase Value")
avg_purchase_tot_person = total_purchase_value/Gender_Table["Total Count"]

Purchase_Ana_Gender = pd.DataFrame({"Purchase Count": purchase_count,
                                    "Average Purchase Price": avg_purchase_price,
                                    "Total Purchase Value": total_purchase_value,
                                    "Avg Total Purchase per Person":avg_purchase_tot_person})
Purchase_Ana_Gender

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [15]:
bins = [1, 10, 14, 19, 24, 29, 35, 39, 100]

group_labels = ["<10","10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"] 

pd.cut(purchase_data_pd["Age"], bins, labels=group_labels).head()

0    20-24
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [16]:
purchase_data_pd["Age Group"] =pd.cut(purchase_data_pd["Age"], bins, labels=group_labels)
purchase_data_pd.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [17]:
player_group = purchase_data_pd.groupby("Age Group")

age_count = purchase_data_pd["Age Group"].value_counts()

age_count

20-24    365
15-19    136
25-29    101
30-34     87
<10       32
35-39     27
10-14     19
40+       13
Name: Age Group, dtype: int64

In [18]:
#Age_Data_Frame = pd.DataFrame({"Age Group": purchase_count,

In [19]:
Age_Percent = (age_count/Number_of_Players) * 100
Age_Percent = Age_Percent.round(2)
Age_Percent

20-24    63.37
15-19    23.61
25-29    17.53
30-34    15.10
<10       5.56
35-39     4.69
10-14     3.30
40+       2.26
Name: Age Group, dtype: float64

In [20]:
Age_Table = pd.DataFrame({"Total Count": age_count,
                          "Percentage of Players": Age_Percent})
Age_Table

       Total Count  Percentage of Players
20-24          365                  63.37
15-19          136                  23.61
25-29          101                  17.53
30-34           87                  15.10
<10             32                   5.56
35-39           27                   4.69
10-14           19                   3.30
40+             13                   2.26

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [21]:
purchase_bins = [1, 10, 14, 19, 24, 29, 35, 39, 100]

purchase_group_labels = ["<10","10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"] 

pd.cut(purchase_data_pd["Age"], purchase_bins, labels=purchase_group_labels).head()

0    20-24
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [22]:
age_purchase_count = purchase_data_pd.groupby(["Age Group"]).count()["Price"].rename("Purchase Count")
age_avg_purchase_price = purchase_data_pd.groupby(['Age Group']).mean()["Price"].rename("Average Purchase Price")
age_total_purchase_value = purchase_data_pd.groupby(['Age Group']).sum()["Price"].rename("Total Purchase Value")
age_avg_purchase_tot_person = age_total_purchase_value/Age_Table["Total Count"]

Purchase_Ana_age = pd.DataFrame({"Purchase Count": age_purchase_count,
                                    "Average Purchase Price": age_avg_purchase_price,
                                    "Total Purchase Value": age_total_purchase_value,
                                    "Avg Total Purchase per Person": age_avg_purchase_tot_person})
Purchase_Ana_age

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
10-14,19,2.681579,50.95,2.681579
15-19,136,3.035956,412.89,3.035956
20-24,365,3.052219,1114.06,3.052219
25-29,101,2.900990,293.00,2.900990
30-34,87,3.057816,266.03,3.057816
35-39,27,3.542222,95.64,3.542222
40+,13,2.941538,38.24,2.941538
<10,32,3.405000,108.96,3.405000

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [23]:
sn_group = purchase_data_pd.groupby("SN")

sn_count = purchase_data_pd["SN"].value_counts()

sn_count.head()

Lisosia93      5
Iral74         4
Idastidru52    4
Inguron55      3
Siallylis44    3
Name: SN, dtype: int64

In [24]:
sn_purchase_count = purchase_data_pd.groupby(["SN"]).count()["Price"].rename("Purchase Count")
sn_avg_purchase_price = purchase_data_pd.groupby(["SN"]).mean()["Price"].rename("Average Purchase Price")
sn_total_purchase_value = purchase_data_pd.groupby(["SN"]).sum()["Price"].rename("Total Purchase Value")

Purchase_Ana_SN = pd.DataFrame({"Purchase Count": sn_purchase_count,
                                    "Average Purchase Price": sn_avg_purchase_price,
                                    "Total Purchase Value": sn_total_purchase_value})
Purchase_Ana_SN.head()

              Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76               1                    2.28                  2.28
Adastirin33                1                    4.48                  4.48
Aeda94                     1                    4.91                  4.91
Aela59                     1                    4.32                  4.32
Aelaria33                  1                    1.79                  1.79

In [25]:
Sorted_df = Purchase_Ana_SN.sort_values("Total Purchase Value", ascending=False)
Sorted_df.head()

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [26]:
most_popular = purchase_data_pd[["Item ID", "Item Name", "Price"]]
most_popular.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [46]:
pop_count = purchase_data_pd.groupby(["Item ID", "Item Name"]).count()["Price"].rename("Purchase Count")
pop_item_price = purchase_data_pd.groupby(["Item ID", "Item Name"]).sum()["Price"].rename("Item Price")
pop_total_purchase_value = pop_count * pop_item_price
#pop_total_purchase_value = purchase_data_pd.groupby(["Item ID", "Item Name"]).sum()["Price"].rename("Total Purchase Value")

Purchase_Ana_Pop = pd.DataFrame({"Purchase Count": pop_count,
                                 "Item Price": pop_item_price,
                                 "Total Purchase Value": pop_total_purchase_value})
Purchase_Ana_Pop.head()

                            Purchase Count  Item Price  Total Purchase Value
Item ID Item Name
0       Splinter                         4        5.12                 20.48
1       Crucifer                         3        9.78                 29.34
2       Verdict                          6       14.88                 89.28
3       Phantomlight                     6       14.94                 89.64
4       Bloodlord's Fetish               5        8.50                 42.50

In [48]:
most_popular_sorted = Purchase_Ana_Pop.sort_values(
    ["Purchase Count"], ascending=False)
most_popular_sorted.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,50.76,609.12
145,Fiery Glass Crusader,9,41.22,370.98
108,"Extraction, Quickblade Of Trembling Hands",9,31.77,285.93
82,Nirvana,9,44.10,396.90
19,"Pursuit, Cudgel of Necromancy",8,8.16,65.28

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [49]:
most_profitable = most_popular_sorted.sort_values(
    ["Total Purchase Value"], ascending=False)
most_profitable.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,50.76,609.12
82,Nirvana,9,44.10,396.90
145,Fiery Glass Crusader,9,41.22,370.98
92,Final Critic,8,39.04,312.32
108,"Extraction, Quickblade Of Trembling Hands",9,31.77,285.93